MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAA176/mcu.h
extern volatile __C1FIFOCI4bits_t C1FIFOCI4bits __asm__ ("C1FIFOCI4") __attribute__((section("sfrs"), address(0xBF880480)));
extern volatile uint32_t        C1FIFOCI4CLR __attribute__((section("sfrs"),address(0xBF880484)));
extern volatile uint32_t        C1FIFOCI4SET __attribute__((section("sfrs"),address(0xBF880488)));
extern volatile uint32_t        C1FIFOCI4INV __attribute__((section("sfrs"),address(0xBF88048C)));
#define C1FIFOCON5 C1FIFOCON5
extern volatile uint32_t   C1FIFOCON5 __attribute__((section("sfrs"), address(0xBF880490)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON5bits_t;
extern volatile __C1FIFOCON5bits_t C1FIFOCON5bits __asm__ ("C1FIFOCON5") __attribute__((section("sfrs"), address(0xBF880490)));
extern volatile uint32_t        C1FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF880494)));
extern volatile uint32_t        C1FIFOCON5SET __attribute__((section("sfrs"),address(0xBF880498)));
extern volatile uint32_t        C1FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88049C)));
#define C1FIFOINT5 C1FIFOINT5
extern volatile uint32_t   C1FIFOINT5 __attribute__((section("sfrs"), address(0xBF8804A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT5bits_t;
extern volatile __C1FIFOINT5bits_t C1FIFOINT5bits __asm__ ("C1FIFOINT5") __attribute__((section("sfrs"), address(0xBF8804A0)));
extern volatile uint32_t        C1FIFOINT5CLR __attribute__((section("sfrs"),address(0xBF8804A4)));
extern volatile uint32_t        C1FIFOINT5SET __attribute__((section("sfrs"),address(0xBF8804A8)));
extern volatile uint32_t        C1FIFOINT5INV __attribute__((section("sfrs"),address(0xBF8804AC)));
#define C1FIFOUA5 C1FIFOUA5
extern volatile uint32_t   C1FIFOUA5 __attribute__((section("sfrs"), address(0xBF8804B0)));
extern volatile uint32_t        C1FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF8804B4)));
extern volatile uint32_t        C1FIFOUA5SET __attribute__((section("sfrs"),address(0xBF8804B8)));
extern volatile uint32_t        C1FIFOUA5INV __attribute__((section("sfrs"),address(0xBF8804BC)));
#define C1FIFOCI5 C1FIFOCI5
extern volatile uint32_t   C1FIFOCI5 __attribute__((section("sfrs"), address(0xBF8804C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI5bits_t;
extern volatile __C1FIFOCI5bits_t C1FIFOCI5bits __asm__ ("C1FIFOCI5") __attribute__((section("sfrs"), address(0xBF8804C0)));
extern volatile uint32_t        C1FIFOCI5CLR __attribute__((section("sfrs"),address(0xBF8804C4)));
extern volatile uint32_t        C1FIFOCI5SET __attribute__((section("sfrs"),address(0xBF8804C8)));
extern volatile uint32_t        C1FIFOCI5INV __attribute__((section("sfrs"),address(0xBF8804CC)));
#define C1FIFOCON6 C1FIFOCON6
extern volatile uint32_t   C1FIFOCON6 __attribute__((section("sfrs"), address(0xBF8804D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON6bits_t;
extern volatile __C1FIFOCON6bits_t C1FIFOCON6bits __asm__ ("C1FIFOCON6") __attribute__((section("sfrs"), address(0xBF8804D0)));
extern volatile uint32_t        C1FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF8804D4)));
extern volatile uint32_t        C1FIFOCON6SET __attribute__((section("sfrs"),address(0xBF8804D8)));
extern volatile uint32_t        C1FIFOCON6INV __attribute__((section("sfrs"),address(0xBF8804DC)));
#define C1FIFOINT6 C1FIFOINT6
extern volatile uint32_t   C1FIFOINT6 __attribute__((section("sfrs"), address(0xBF8804E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT6bits_t;
extern volatile __C1FIFOINT6bits_t C1FIFOINT6bits __asm__ ("C1FIFOINT6") __attribute__((section("sfrs"), address(0xBF8804E0)));
extern volatile uint32_t        C1FIFOINT6CLR __attribute__((section("sfrs"),address(0xBF8804E4)));
extern volatile uint32_t        C1FIFOINT6SET __attribute__((section("sfrs"),address(0xBF8804E8)));
extern volatile uint32_t        C1FIFOINT6INV __attribute__((section("sfrs"),address(0xBF8804EC)));
#define C1FIFOUA6 C1FIFOUA6
extern volatile uint32_t   C1FIFOUA6 __attribute__((section("sfrs"), address(0xBF8804F0)));
extern volatile uint32_t        C1FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF8804F4)));
extern volatile uint32_t        C1FIFOUA6SET __attribute__((section("sfrs"),address(0xBF8804F8)));
extern volatile uint32_t        C1FIFOUA6INV __attribute__((section("sfrs"),address(0xBF8804FC)));
#define C1FIFOCI6 C1FIFOCI6
extern volatile uint32_t   C1FIFOCI6 __attribute__((section("sfrs"), address(0xBF880500)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI6bits_t;
extern volatile __C1FIFOCI6bits_t C1FIFOCI6bits __asm__ ("C1FIFOCI6") __attribute__((section("sfrs"), address(0xBF880500)));
extern volatile uint32_t        C1FIFOCI6CLR __attribute__((section("sfrs"),address(0xBF880504)));
extern volatile uint32_t        C1FIFOCI6SET __attribute__((section("sfrs"),address(0xBF880508)));
extern volatile uint32_t        C1FIFOCI6INV __attribute__((section("sfrs"),address(0xBF88050C)));
#define C1FIFOCON7 C1FIFOCON7
extern volatile uint32_t   C1FIFOCON7 __attribute__((section("sfrs"), address(0xBF880510)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON7bits_t;
extern volatile __C1FIFOCON7bits_t C1FIFOCON7bits __asm__ ("C1FIFOCON7") __attribute__((section("sfrs"), address(0xBF880510)));
extern volatile uint32_t        C1FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF880514)));
extern volatile uint32_t        C1FIFOCON7SET __attribute__((section("sfrs"),address(0xBF880518)));
extern volatile uint32_t        C1FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88051C)));
#define C1FIFOINT7 C1FIFOINT7
extern volatile uint32_t   C1FIFOINT7 __attribute__((section("sfrs"), address(0xBF880520)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT7bits_t;
