MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAA176/mcu.h
extern volatile __GLCDCURDATA50bits_t GLCDCURDATA50bits __asm__ ("GLCDCURDATA50") __attribute__((section("sfrs"), address(0xBF8EA8C8)));
#define GLCDCURDATA51 GLCDCURDATA51
extern volatile uint32_t   GLCDCURDATA51 __attribute__((section("sfrs"), address(0xBF8EA8CC)));
typedef struct {
  uint32_t PIXEL1231:4;
  uint32_t PIXEL1230:4;
  uint32_t PIXEL1229:4;
  uint32_t PIXEL1228:4;
  uint32_t PIXEL1227:4;
  uint32_t PIXEL1226:4;
  uint32_t PIXEL1225:4;
  uint32_t PIXEL1224:4;
} __GLCDCURDATA51bits_t;
extern volatile __GLCDCURDATA51bits_t GLCDCURDATA51bits __asm__ ("GLCDCURDATA51") __attribute__((section("sfrs"), address(0xBF8EA8CC)));
#define GLCDCURDATA52 GLCDCURDATA52
extern volatile uint32_t   GLCDCURDATA52 __attribute__((section("sfrs"), address(0xBF8EA8D0)));
typedef struct {
  uint32_t PIXEL137:4;
  uint32_t PIXEL136:4;
  uint32_t PIXEL135:4;
  uint32_t PIXEL134:4;
  uint32_t PIXEL133:4;
  uint32_t PIXEL132:4;
  uint32_t PIXEL131:4;
  uint32_t PIXEL130:4;
} __GLCDCURDATA52bits_t;
extern volatile __GLCDCURDATA52bits_t GLCDCURDATA52bits __asm__ ("GLCDCURDATA52") __attribute__((section("sfrs"), address(0xBF8EA8D0)));
#define GLCDCURDATA53 GLCDCURDATA53
extern volatile uint32_t   GLCDCURDATA53 __attribute__((section("sfrs"), address(0xBF8EA8D4)));
typedef struct {
  uint32_t PIXEL1315:4;
  uint32_t PIXEL1314:4;
  uint32_t PIXEL1313:4;
  uint32_t PIXEL1312:4;
  uint32_t PIXEL1311:4;
  uint32_t PIXEL1310:4;
  uint32_t PIXEL139:4;
  uint32_t PIXEL138:4;
} __GLCDCURDATA53bits_t;
extern volatile __GLCDCURDATA53bits_t GLCDCURDATA53bits __asm__ ("GLCDCURDATA53") __attribute__((section("sfrs"), address(0xBF8EA8D4)));
#define GLCDCURDATA54 GLCDCURDATA54
extern volatile uint32_t   GLCDCURDATA54 __attribute__((section("sfrs"), address(0xBF8EA8D8)));
typedef struct {
  uint32_t PIXEL1323:4;
  uint32_t PIXEL1322:4;
  uint32_t PIXEL1321:4;
  uint32_t PIXEL1320:4;
  uint32_t PIXEL1319:4;
  uint32_t PIXEL1318:4;
  uint32_t PIXEL1317:4;
  uint32_t PIXEL1316:4;
} __GLCDCURDATA54bits_t;
extern volatile __GLCDCURDATA54bits_t GLCDCURDATA54bits __asm__ ("GLCDCURDATA54") __attribute__((section("sfrs"), address(0xBF8EA8D8)));
#define GLCDCURDATA55 GLCDCURDATA55
extern volatile uint32_t   GLCDCURDATA55 __attribute__((section("sfrs"), address(0xBF8EA8DC)));
typedef struct {
  uint32_t PIXEL1331:4;
  uint32_t PIXEL1330:4;
  uint32_t PIXEL1329:4;
  uint32_t PIXEL1328:4;
  uint32_t PIXEL1327:4;
  uint32_t PIXEL1326:4;
  uint32_t PIXEL1325:4;
  uint32_t PIXEL1324:4;
} __GLCDCURDATA55bits_t;
extern volatile __GLCDCURDATA55bits_t GLCDCURDATA55bits __asm__ ("GLCDCURDATA55") __attribute__((section("sfrs"), address(0xBF8EA8DC)));
#define GLCDCURDATA56 GLCDCURDATA56
extern volatile uint32_t   GLCDCURDATA56 __attribute__((section("sfrs"), address(0xBF8EA8E0)));
typedef struct {
  uint32_t PIXEL147:4;
  uint32_t PIXEL146:4;
  uint32_t PIXEL145:4;
  uint32_t PIXEL144:4;
  uint32_t PIXEL143:4;
  uint32_t PIXEL142:4;
  uint32_t PIXEL141:4;
  uint32_t PIXEL140:4;
} __GLCDCURDATA56bits_t;
extern volatile __GLCDCURDATA56bits_t GLCDCURDATA56bits __asm__ ("GLCDCURDATA56") __attribute__((section("sfrs"), address(0xBF8EA8E0)));
#define GLCDCURDATA57 GLCDCURDATA57
extern volatile uint32_t   GLCDCURDATA57 __attribute__((section("sfrs"), address(0xBF8EA8E4)));
typedef struct {
  uint32_t PIXEL1415:4;
  uint32_t PIXEL1414:4;
  uint32_t PIXEL1413:4;
  uint32_t PIXEL1412:4;
  uint32_t PIXEL1411:4;
  uint32_t PIXEL1410:4;
  uint32_t PIXEL149:4;
  uint32_t PIXEL148:4;
} __GLCDCURDATA57bits_t;
extern volatile __GLCDCURDATA57bits_t GLCDCURDATA57bits __asm__ ("GLCDCURDATA57") __attribute__((section("sfrs"), address(0xBF8EA8E4)));
#define GLCDCURDATA58 GLCDCURDATA58
extern volatile uint32_t   GLCDCURDATA58 __attribute__((section("sfrs"), address(0xBF8EA8E8)));
typedef struct {
  uint32_t PIXEL1423:4;
  uint32_t PIXEL1422:4;
  uint32_t PIXEL1421:4;
  uint32_t PIXEL1420:4;
  uint32_t PIXEL1419:4;
  uint32_t PIXEL1418:4;
  uint32_t PIXEL1417:4;
  uint32_t PIXEL1416:4;
} __GLCDCURDATA58bits_t;
extern volatile __GLCDCURDATA58bits_t GLCDCURDATA58bits __asm__ ("GLCDCURDATA58") __attribute__((section("sfrs"), address(0xBF8EA8E8)));
#define GLCDCURDATA59 GLCDCURDATA59
extern volatile uint32_t   GLCDCURDATA59 __attribute__((section("sfrs"), address(0xBF8EA8EC)));
typedef struct {
  uint32_t PIXEL1431:4;
  uint32_t PIXEL1430:4;
  uint32_t PIXEL1429:4;
  uint32_t PIXEL1428:4;
  uint32_t PIXEL1427:4;
  uint32_t PIXEL1426:4;
  uint32_t PIXEL1425:4;
  uint32_t PIXEL1424:4;
} __GLCDCURDATA59bits_t;
extern volatile __GLCDCURDATA59bits_t GLCDCURDATA59bits __asm__ ("GLCDCURDATA59") __attribute__((section("sfrs"), address(0xBF8EA8EC)));
#define GLCDCURDATA60 GLCDCURDATA60
extern volatile uint32_t   GLCDCURDATA60 __attribute__((section("sfrs"), address(0xBF8EA8F0)));
typedef struct {
  uint32_t PIXEL157:4;
  uint32_t PIXEL156:4;
  uint32_t PIXEL155:4;
  uint32_t PIXEL154:4;
  uint32_t PIXEL153:4;
  uint32_t PIXEL152:4;
  uint32_t PIXEL151:4;
  uint32_t PIXEL150:4;
} __GLCDCURDATA60bits_t;
extern volatile __GLCDCURDATA60bits_t GLCDCURDATA60bits __asm__ ("GLCDCURDATA60") __attribute__((section("sfrs"), address(0xBF8EA8F0)));
#define GLCDCURDATA61 GLCDCURDATA61
extern volatile uint32_t   GLCDCURDATA61 __attribute__((section("sfrs"), address(0xBF8EA8F4)));
typedef struct {
  uint32_t PIXEL1515:4;
  uint32_t PIXEL1514:4;
  uint32_t PIXEL1513:4;
  uint32_t PIXEL1512:4;
  uint32_t PIXEL1511:4;
  uint32_t PIXEL1510:4;
  uint32_t PIXEL159:4;
  uint32_t PIXEL158:4;
} __GLCDCURDATA61bits_t;
extern volatile __GLCDCURDATA61bits_t GLCDCURDATA61bits __asm__ ("GLCDCURDATA61") __attribute__((section("sfrs"), address(0xBF8EA8F4)));
#define GLCDCURDATA62 GLCDCURDATA62
extern volatile uint32_t   GLCDCURDATA62 __attribute__((section("sfrs"), address(0xBF8EA8F8)));
typedef struct {
  uint32_t PIXEL1523:4;
  uint32_t PIXEL1522:4;
  uint32_t PIXEL1521:4;
  uint32_t PIXEL1520:4;
  uint32_t PIXEL1519:4;
  uint32_t PIXEL1518:4;
  uint32_t PIXEL1517:4;
  uint32_t PIXEL1516:4;
} __GLCDCURDATA62bits_t;
extern volatile __GLCDCURDATA62bits_t GLCDCURDATA62bits __asm__ ("GLCDCURDATA62") __attribute__((section("sfrs"), address(0xBF8EA8F8)));
#define GLCDCURDATA63 GLCDCURDATA63
extern volatile uint32_t   GLCDCURDATA63 __attribute__((section("sfrs"), address(0xBF8EA8FC)));
typedef struct {
  uint32_t PIXEL1531:4;
  uint32_t PIXEL1530:4;
  uint32_t PIXEL1529:4;
  uint32_t PIXEL1528:4;
  uint32_t PIXEL1527:4;
  uint32_t PIXEL1526:4;
  uint32_t PIXEL1525:4;
  uint32_t PIXEL1524:4;
} __GLCDCURDATA63bits_t;
extern volatile __GLCDCURDATA63bits_t GLCDCURDATA63bits __asm__ ("GLCDCURDATA63") __attribute__((section("sfrs"), address(0xBF8EA8FC)));
#define GLCDCURDATA64 GLCDCURDATA64
extern volatile uint32_t   GLCDCURDATA64 __attribute__((section("sfrs"), address(0xBF8EA900)));
typedef struct {
  uint32_t PIXEL167:4;
  uint32_t PIXEL166:4;
  uint32_t PIXEL165:4;
  uint32_t PIXEL164:4;
  uint32_t PIXEL163:4;
  uint32_t PIXEL162:4;
  uint32_t PIXEL161:4;
  uint32_t PIXEL160:4;
} __GLCDCURDATA64bits_t;
extern volatile __GLCDCURDATA64bits_t GLCDCURDATA64bits __asm__ ("GLCDCURDATA64") __attribute__((section("sfrs"), address(0xBF8EA900)));
#define GLCDCURDATA65 GLCDCURDATA65
extern volatile uint32_t   GLCDCURDATA65 __attribute__((section("sfrs"), address(0xBF8EA904)));
typedef struct {
  uint32_t PIXEL1615:4;
  uint32_t PIXEL1614:4;
  uint32_t PIXEL1613:4;
  uint32_t PIXEL1612:4;
  uint32_t PIXEL1611:4;
  uint32_t PIXEL1610:4;
  uint32_t PIXEL169:4;
  uint32_t PIXEL168:4;
} __GLCDCURDATA65bits_t;
extern volatile __GLCDCURDATA65bits_t GLCDCURDATA65bits __asm__ ("GLCDCURDATA65") __attribute__((section("sfrs"), address(0xBF8EA904)));
#define GLCDCURDATA66 GLCDCURDATA66
extern volatile uint32_t   GLCDCURDATA66 __attribute__((section("sfrs"), address(0xBF8EA908)));
typedef struct {
  uint32_t PIXEL1623:4;
  uint32_t PIXEL1622:4;
  uint32_t PIXEL1621:4;
  uint32_t PIXEL1620:4;
  uint32_t PIXEL1619:4;
  uint32_t PIXEL1618:4;
  uint32_t PIXEL1617:4;
  uint32_t PIXEL1616:4;
} __GLCDCURDATA66bits_t;
extern volatile __GLCDCURDATA66bits_t GLCDCURDATA66bits __asm__ ("GLCDCURDATA66") __attribute__((section("sfrs"), address(0xBF8EA908)));
#define GLCDCURDATA67 GLCDCURDATA67
extern volatile uint32_t   GLCDCURDATA67 __attribute__((section("sfrs"), address(0xBF8EA90C)));
typedef struct {
  uint32_t PIXEL1631:4;
  uint32_t PIXEL1630:4;
  uint32_t PIXEL1629:4;
  uint32_t PIXEL1628:4;
  uint32_t PIXEL1627:4;
  uint32_t PIXEL1626:4;
  uint32_t PIXEL1625:4;
  uint32_t PIXEL1624:4;
} __GLCDCURDATA67bits_t;
extern volatile __GLCDCURDATA67bits_t GLCDCURDATA67bits __asm__ ("GLCDCURDATA67") __attribute__((section("sfrs"), address(0xBF8EA90C)));
#define GLCDCURDATA68 GLCDCURDATA68
extern volatile uint32_t   GLCDCURDATA68 __attribute__((section("sfrs"), address(0xBF8EA910)));
typedef struct {
  uint32_t PIXEL177:4;
  uint32_t PIXEL176:4;
  uint32_t PIXEL175:4;
  uint32_t PIXEL174:4;
  uint32_t PIXEL173:4;
  uint32_t PIXEL172:4;
  uint32_t PIXEL171:4;
  uint32_t PIXEL170:4;
} __GLCDCURDATA68bits_t;
