MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAA176/mcu.h
#define _GLCDCLUT243_GREEN_POSITION              0x00000008
#define _GLCDCLUT243_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT243_GREEN_LENGTH                0x00000008

#define _GLCDCLUT243_RED_POSITION                0x00000010
#define _GLCDCLUT243_RED_MASK                    0x00FF0000
#define _GLCDCLUT243_RED_LENGTH                  0x00000008

#define _GLCDCLUT244_BLUE_POSITION               0x00000000
#define _GLCDCLUT244_BLUE_MASK                   0x000000FF
#define _GLCDCLUT244_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT244_GREEN_POSITION              0x00000008
#define _GLCDCLUT244_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT244_GREEN_LENGTH                0x00000008

#define _GLCDCLUT244_RED_POSITION                0x00000010
#define _GLCDCLUT244_RED_MASK                    0x00FF0000
#define _GLCDCLUT244_RED_LENGTH                  0x00000008

#define _GLCDCLUT245_BLUE_POSITION               0x00000000
#define _GLCDCLUT245_BLUE_MASK                   0x000000FF
#define _GLCDCLUT245_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT245_GREEN_POSITION              0x00000008
#define _GLCDCLUT245_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT245_GREEN_LENGTH                0x00000008

#define _GLCDCLUT245_RED_POSITION                0x00000010
#define _GLCDCLUT245_RED_MASK                    0x00FF0000
#define _GLCDCLUT245_RED_LENGTH                  0x00000008

#define _GLCDCLUT246_BLUE_POSITION               0x00000000
#define _GLCDCLUT246_BLUE_MASK                   0x000000FF
#define _GLCDCLUT246_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT246_GREEN_POSITION              0x00000008
#define _GLCDCLUT246_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT246_GREEN_LENGTH                0x00000008

#define _GLCDCLUT246_RED_POSITION                0x00000010
#define _GLCDCLUT246_RED_MASK                    0x00FF0000
#define _GLCDCLUT246_RED_LENGTH                  0x00000008

#define _GLCDCLUT247_BLUE_POSITION               0x00000000
#define _GLCDCLUT247_BLUE_MASK                   0x000000FF
#define _GLCDCLUT247_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT247_GREEN_POSITION              0x00000008
#define _GLCDCLUT247_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT247_GREEN_LENGTH                0x00000008

#define _GLCDCLUT247_RED_POSITION                0x00000010
#define _GLCDCLUT247_RED_MASK                    0x00FF0000
#define _GLCDCLUT247_RED_LENGTH                  0x00000008

#define _GLCDCLUT248_BLUE_POSITION               0x00000000
#define _GLCDCLUT248_BLUE_MASK                   0x000000FF
#define _GLCDCLUT248_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT248_GREEN_POSITION              0x00000008
#define _GLCDCLUT248_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT248_GREEN_LENGTH                0x00000008

#define _GLCDCLUT248_RED_POSITION                0x00000010
#define _GLCDCLUT248_RED_MASK                    0x00FF0000
#define _GLCDCLUT248_RED_LENGTH                  0x00000008

#define _GLCDCLUT249_BLUE_POSITION               0x00000000
#define _GLCDCLUT249_BLUE_MASK                   0x000000FF
#define _GLCDCLUT249_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT249_GREEN_POSITION              0x00000008
#define _GLCDCLUT249_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT249_GREEN_LENGTH                0x00000008

#define _GLCDCLUT249_RED_POSITION                0x00000010
#define _GLCDCLUT249_RED_MASK                    0x00FF0000
#define _GLCDCLUT249_RED_LENGTH                  0x00000008

#define _GLCDCLUT250_BLUE_POSITION               0x00000000
#define _GLCDCLUT250_BLUE_MASK                   0x000000FF
#define _GLCDCLUT250_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT250_GREEN_POSITION              0x00000008
#define _GLCDCLUT250_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT250_GREEN_LENGTH                0x00000008

#define _GLCDCLUT250_RED_POSITION                0x00000010
#define _GLCDCLUT250_RED_MASK                    0x00FF0000
#define _GLCDCLUT250_RED_LENGTH                  0x00000008

#define _GLCDCLUT251_BLUE_POSITION               0x00000000
#define _GLCDCLUT251_BLUE_MASK                   0x000000FF
#define _GLCDCLUT251_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT251_GREEN_POSITION              0x00000008
#define _GLCDCLUT251_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT251_GREEN_LENGTH                0x00000008

#define _GLCDCLUT251_RED_POSITION                0x00000010
#define _GLCDCLUT251_RED_MASK                    0x00FF0000
#define _GLCDCLUT251_RED_LENGTH                  0x00000008

#define _GLCDCLUT252_BLUE_POSITION               0x00000000
#define _GLCDCLUT252_BLUE_MASK                   0x000000FF
#define _GLCDCLUT252_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT252_GREEN_POSITION              0x00000008
#define _GLCDCLUT252_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT252_GREEN_LENGTH                0x00000008

#define _GLCDCLUT252_RED_POSITION                0x00000010
#define _GLCDCLUT252_RED_MASK                    0x00FF0000
#define _GLCDCLUT252_RED_LENGTH                  0x00000008

#define _GLCDCLUT253_BLUE_POSITION               0x00000000
#define _GLCDCLUT253_BLUE_MASK                   0x000000FF
#define _GLCDCLUT253_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT253_GREEN_POSITION              0x00000008
#define _GLCDCLUT253_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT253_GREEN_LENGTH                0x00000008

#define _GLCDCLUT253_RED_POSITION                0x00000010
#define _GLCDCLUT253_RED_MASK                    0x00FF0000
#define _GLCDCLUT253_RED_LENGTH                  0x00000008

#define _GLCDCLUT254_BLUE_POSITION               0x00000000
#define _GLCDCLUT254_BLUE_MASK                   0x000000FF
#define _GLCDCLUT254_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT254_GREEN_POSITION              0x00000008
#define _GLCDCLUT254_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT254_GREEN_LENGTH                0x00000008

#define _GLCDCLUT254_RED_POSITION                0x00000010
#define _GLCDCLUT254_RED_MASK                    0x00FF0000
#define _GLCDCLUT254_RED_LENGTH                  0x00000008

