MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAA176/mcu.h
#define _SDHCFE_FECEBE_POSITION                  0x00000012
#define _SDHCFE_FECEBE_MASK                      0x00040000
#define _SDHCFE_FECEBE_LENGTH                    0x00000001

#define _SDHCFE_FEIDXE_POSITION                  0x00000013
#define _SDHCFE_FEIDXE_MASK                      0x00080000
#define _SDHCFE_FEIDXE_LENGTH                    0x00000001

#define _SDHCFE_FEDTOE_POSITION                  0x00000014
#define _SDHCFE_FEDTOE_MASK                      0x00100000
#define _SDHCFE_FEDTOE_LENGTH                    0x00000001

#define _SDHCFE_FEDCRCE_POSITION                 0x00000015
#define _SDHCFE_FEDCRCE_MASK                     0x00200000
#define _SDHCFE_FEDCRCE_LENGTH                   0x00000001

#define _SDHCFE_FEDEBE_POSITION                  0x00000016
#define _SDHCFE_FEDEBE_MASK                      0x00400000
#define _SDHCFE_FEDEBE_LENGTH                    0x00000001

#define _SDHCFE_FECLE_POSITION                   0x00000017
#define _SDHCFE_FECLE_MASK                       0x00800000
#define _SDHCFE_FECLE_LENGTH                     0x00000001

#define _SDHCFE_FEACE_POSITION                   0x00000018
#define _SDHCFE_FEACE_MASK                       0x01000000
#define _SDHCFE_FEACE_LENGTH                     0x00000001

#define _SDHCFE_FEAE_POSITION                    0x00000019
#define _SDHCFE_FEAE_MASK                        0x02000000
#define _SDHCFE_FEAE_LENGTH                      0x00000001

#define _SDHCAESTAT_AERRST_POSITION              0x00000000
#define _SDHCAESTAT_AERRST_MASK                  0x00000003
#define _SDHCAESTAT_AERRST_LENGTH                0x00000002

#define _SDHCAESTAT_ALMERR_POSITION              0x00000002
#define _SDHCAESTAT_ALMERR_MASK                  0x00000004
#define _SDHCAESTAT_ALMERR_LENGTH                0x00000001

#define _SDHCAADDR_ADDR_POSITION                 0x00000000
#define _SDHCAADDR_ADDR_MASK                     0xFFFFFFFF
#define _SDHCAADDR_ADDR_LENGTH                   0x00000020

#define _SBFLAG0_T1PGV_POSITION                  0x00000000
#define _SBFLAG0_T1PGV_MASK                      0x00000001
#define _SBFLAG0_T1PGV_LENGTH                    0x00000001

#define _SBFLAG0_T4PGV_POSITION                  0x00000001
#define _SBFLAG0_T4PGV_MASK                      0x00000002
#define _SBFLAG0_T4PGV_LENGTH                    0x00000001

#define _SBFLAG0_T5PGV_POSITION                  0x00000002
#define _SBFLAG0_T5PGV_MASK                      0x00000004
#define _SBFLAG0_T5PGV_LENGTH                    0x00000001

#define _SBFLAG0_T2PGV_POSITION                  0x00000003
#define _SBFLAG0_T2PGV_MASK                      0x00000008
#define _SBFLAG0_T2PGV_LENGTH                    0x00000001

#define _SBFLAG0_T6PGV_POSITION                  0x00000004
#define _SBFLAG0_T6PGV_MASK                      0x00000010
#define _SBFLAG0_T6PGV_LENGTH                    0x00000001

#define _SBFLAG0_T0PGV0_POSITION                 0x00000005
#define _SBFLAG0_T0PGV0_MASK                     0x00000020
#define _SBFLAG0_T0PGV0_LENGTH                   0x00000001

#define _SBT0ELOG1_CMD_POSITION                  0x00000000
#define _SBT0ELOG1_CMD_MASK                      0x00000007
#define _SBT0ELOG1_CMD_LENGTH                    0x00000003

#define _SBT0ELOG1_REGION_POSITION               0x00000004
#define _SBT0ELOG1_REGION_MASK                   0x000000F0
#define _SBT0ELOG1_REGION_LENGTH                 0x00000004

#define _SBT0ELOG1_INITID_POSITION               0x00000008
#define _SBT0ELOG1_INITID_MASK                   0x0000FF00
#define _SBT0ELOG1_INITID_LENGTH                 0x00000008

#define _SBT0ELOG1_CODE_POSITION                 0x00000018
#define _SBT0ELOG1_CODE_MASK                     0x0F000000
#define _SBT0ELOG1_CODE_LENGTH                   0x00000004

#define _SBT0ELOG1_MULTI_POSITION                0x0000001F
#define _SBT0ELOG1_MULTI_MASK                    0x80000000
#define _SBT0ELOG1_MULTI_LENGTH                  0x00000001

#define _SBT0ELOG2_GROUP_POSITION                0x00000000
#define _SBT0ELOG2_GROUP_MASK                    0x00000003
#define _SBT0ELOG2_GROUP_LENGTH                  0x00000002

#define _SBT0ECON_ERRP_POSITION                  0x00000018
#define _SBT0ECON_ERRP_MASK                      0x01000000
#define _SBT0ECON_ERRP_LENGTH                    0x00000001

#define _SBT0ECLRS_CLEAR_POSITION                0x00000000
#define _SBT0ECLRS_CLEAR_MASK                    0x00000001
#define _SBT0ECLRS_CLEAR_LENGTH                  0x00000001

#define _SBT0ECLRM_CLEAR_POSITION                0x00000000
#define _SBT0ECLRM_CLEAR_MASK                    0x00000001
#define _SBT0ECLRM_CLEAR_LENGTH                  0x00000001

#define _SBT0REG0_SIZE_POSITION                  0x00000003
#define _SBT0REG0_SIZE_MASK                      0x000000F8
#define _SBT0REG0_SIZE_LENGTH                    0x00000005

#define _SBT0REG0_PRI_POSITION                   0x00000009
#define _SBT0REG0_PRI_MASK                       0x00000200
#define _SBT0REG0_PRI_LENGTH                     0x00000001

#define _SBT0REG0_BASE_POSITION                  0x0000000A
#define _SBT0REG0_BASE_MASK                      0xFFFFFC00
#define _SBT0REG0_BASE_LENGTH                    0x00000016

#define _SBT0RD0_GROUP0_POSITION                 0x00000000
#define _SBT0RD0_GROUP0_MASK                     0x00000001
#define _SBT0RD0_GROUP0_LENGTH                   0x00000001

#define _SBT0RD0_GROUP1_POSITION                 0x00000001
#define _SBT0RD0_GROUP1_MASK                     0x00000002
#define _SBT0RD0_GROUP1_LENGTH                   0x00000001

#define _SBT0RD0_GROUP2_POSITION                 0x00000002
#define _SBT0RD0_GROUP2_MASK                     0x00000004
#define _SBT0RD0_GROUP2_LENGTH                   0x00000001

#define _SBT0RD0_GROUP3_POSITION                 0x00000003
#define _SBT0RD0_GROUP3_MASK                     0x00000008
#define _SBT0RD0_GROUP3_LENGTH                   0x00000001

#define _SBT0WR0_GROUP0_POSITION                 0x00000000
#define _SBT0WR0_GROUP0_MASK                     0x00000001
#define _SBT0WR0_GROUP0_LENGTH                   0x00000001

#define _SBT0WR0_GROUP1_POSITION                 0x00000001
#define _SBT0WR0_GROUP1_MASK                     0x00000002
#define _SBT0WR0_GROUP1_LENGTH                   0x00000001

#define _SBT0WR0_GROUP2_POSITION                 0x00000002
#define _SBT0WR0_GROUP2_MASK                     0x00000004
#define _SBT0WR0_GROUP2_LENGTH                   0x00000001

#define _SBT0WR0_GROUP3_POSITION                 0x00000003
#define _SBT0WR0_GROUP3_MASK                     0x00000008
#define _SBT0WR0_GROUP3_LENGTH                   0x00000001

#define _SBT0REG1_SIZE_POSITION                  0x00000003
#define _SBT0REG1_SIZE_MASK                      0x000000F8
#define _SBT0REG1_SIZE_LENGTH                    0x00000005

